address_map/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", ""], ["address", ""], ["created_at", "2016-08-17 21:39:01.588184"], ["updated_at", "2016-08-17 21:39:01.588184"]]