craigslistjr/app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "categories".* FROM "categories"
SELECT "items".* FROM "items"
---
  def show
    @category = Category.find(params[:id])
    @categories = Category.all
    @items = Item.all