craigslistjr/app/controllers/items_controller.rb

  def show
    @item = Item.find(params[:id])
    @category = Category.find(params[:category_id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT 1  [["id", 27]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 9]]

  def create
    @category = Category.find(params[:category_id])
    @item = @category.items.create(item_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT 1  [["id", 4]]
INSERT INTO "items" ("title", "price", "email", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "chicken"], ["price", 53], ["email", "taco@tacoi.com"], ["category_id", 4], ["created_at", "2016-08-11 22:51:19.988817"], ["updated_at", "2016-08-11 22:51:19.988817"]]